
///////////////////////////////////////////////////////////////
//                                                           //
//  Τμήμα Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών.  //
//                                                           //
//  Δομημένος Προγραμματισμός                                //
//  1ο εξάμηνο | 2021 - 2022                                 //
//                                                           //
//  ΕΡΓΑΣΙΑ ΕΞΑΜΗΝΟΥ                                         //
//                                                           //
//  Υπεύθυνοι Καθηγητές: Σεβαστιάδης Χρήστος,                //
//                       Σιαχούδης Αθανάσιος                 //
//                                                           //
//  Δημιουργοί του προγράμματος: Μπαρμπαγιάννος Βασίλειος,   //
//                               Κόκκινος Γεώργιος           //
//                                                           //
//  2022 All Rights Reserved ©                               //
//                                                           //
///////////////////////////////////////////////////////////////


#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#define PI 3.1415926


int main(){

    const int m, n; // Οι διαστάσεις του πίνακα A.
    const int k, j; // Οι διαστάσεις του πίνακα B.
    const int d1, d2; // Οι διαστάσεις των δύο διανυσμάτων.

    int numA, numB; // Αριθμοί γεμίσματος πινάκων.
    int num1, num2; // Αριθμοί γεμίσματος διανυσμάτων.

    const int epilogiA; // Μεταβλητή επιλογής για το αν θέλει ο χρήστης να γεμίσει μόνος του τον πίνακα
    const int epilogiB; // ή να τον γεμίσει ο υπολογιστής με ψευδοτυχαίους.

    const int epilogi1; // Μεταβλητή επιλογής για το αν θέλει ο χρήστης να γεμίσει μόνος του το διάνυσμα
    const int epilogi2; // ή να το γεμίσει ο υπολογιστής με ψευδοτυχαίους.

    const int praji1; // Μεταβλητή επιλογής για το ποια πράξη θέλει να εκτελέσει ο χρήστης μεταξύ ΠΙΝΑΚΩΝ.
    const int praji2; // Μεταβλητή επιλογής για το ποια πράξη θέλει να εκτελέσει ο χρήστης μεταξύ ΔΙΑΝΥΣΜΑΤΩΝ.

    printf("Καλώς ορίσατε στο πρόγραμμα - Πράξεις Πινάκων - !!!\n");
    printf("Δώστε μας πίνακες και διανύσματα και θα τα υπολογίσουμε όλα, εμείς για εσάς!\n\n");

    // Οι διαστάσεις πρέπει να δωθούν στη μορφή διάσταση1xδιάσταση2. Θα συμπεριλαμβάνεται στις οδηγίες.
    // Επίσης μέχρι 5x5, προς αποφυγήν υπερβολών.
    printf("Δώσε τις διαστάσεις του πίνακα Α.\n");

    while(1 > 0){

        printf("> ");
        scanf("%dx%d", &m, &n);

        if((m >= 0 && m <= 5) && (n >= 0 && n <= 5)){

            break;
        }

        printf("Δώσε ξανά σωστές διαστάσεις.\n");
    }

    printf("\nΔώσε τις διαστάσεις του πίνακα Β.\n");

    while(1 > 0){

        printf("> ");
        scanf("%dx%d", &k, &j);


        if((k >= 0 && k <= 5) && (j >= 0 && j <= 5)){

            break;
        }

        printf("Δώσε ξανά σωστές διαστάσεις.\n");
    }


    //////////////////////// Τελείωσε μία θεματική ενότητα. ////////////////////////

    printf("\nΔώσε την διάσταση του πρώτου διανύσματος (1 - 5).\n"); // Από 1 έως 5.

    while(1 > 0){

        printf("> ");
        scanf("%d", &d1);

        if(d1 >= 1 && d1 <= 5){

            break;
        }

        printf("Δώσε ξανά σωστή διάσταση\n");
    }

    printf("\nΔώσε την διάσταση του δεύτερου διανύσματος (1 - 5).\n"); // Από 1 έως 5.

    while(1 > 0){

        printf("> ");
        scanf("%d", &d2);

        if(d2 >= 1 && d2 <= 5){

            break;
        }

        printf("Δώσε ξανά σωστή διάσταση\n");
    }

    // Εδώ πέρα, αφού έχουμε πάρει τις τιμές διαστάσεων, ορίζουμε πλέον τους πίνακες και τα διανύσματα.
    int matrixA[m][n];
    int matrixB[k][j];

    int vectorA[d1];
    int vectorB[d2];

    printf("\nΟι διαστάσεις του πίνακα Α είναι %d x %d.", m, n);
    if(m == n){
        printf("(τετραγωνικός)");
    }
    printf("\nΟι διαστάσεις του πίνακα Β είναι %d x %d.", k, j);
    if(k == j){
        printf("(τετραγωνικός)\n");
    }
    else{
        printf("\n");
    }

    printf("\nΤο 1ο σου διάνυσμα έχει διάσταση 1 x %d (ή, ισοδύναμα, %d x 1).\n", d1, d1);
    printf("Το 2ο σου διάνυσμα έχει διάσταση 1 x %d (ή, ισοδύναμα, %d x 1).\n", d2, d2);


    //////////////////////////////////////
    //////////////////////////////////////
    //////////////////////////////////////


    printf("\nΘέλεις να γεμίσεις τον πίνακα Α μόνος σου (με διψήφιους ακεραίους 0-10)[πληκτρολόγησε 0]\nή να το κάνει ο υπολογιστής με ψευδοτυχαίους [πληκτρολόγησε 1];\n");

    while(1){

        printf("> ");
        scanf("%d", &epilogiA);

        if(epilogiA == 0){

            printf("\nΓέμισέ τον!\n");

            // Γέμισμα.
            for(int a = 0; a < m; a++){

                for(int b = 0; b < n; b++){

                    printf("> ");
                    scanf("%d", &numA);

                    if(numA >= 0 && numA <= 10){

                        matrixA[a][b] = numA;
                    }
                    else{

                        printf("Δώσε αριθμό εντός ορίων.\n");
                        b--; // Στέλνει το for μία φορά πίσω ώστε να ξαναδώσει τιμή ο χρήστης.
                    }
                }
            }
            break;
        }

        else if(epilogiA == 1){

            // Γέμισμα.
            for(int a = 0; a < m; a++){

                for(int b = 0; b < n; b++){

                    matrixA[a][b] = rand()%10;
                }
            }
            break;
        }

        printf("\nΠληκτρολόγησε σωστά.\n");
    }

    printf("\nΘέλεις να γεμίσεις τον πίνακα B μόνος σου (με διψήφιους ακεραίους 0-10)[πληκτρολόγησε 0]]\nή να το κάνει ο υπολογιστής με ψευδοτυχαίους [πληκτρολόγησε 1];\n");

    while(1){

        printf("> ");
        scanf("%d", &epilogiB);

        if(epilogiB == 0){

            printf("\nΓέμισέ τον!\n");

            // Γέμισμα.
            for(int a = 0; a < k; a++){

                for(int b = 0; b < j; b++){

                    printf("> ");
                    scanf("%d", &numB);

                    if(numB >= 0 && numB <= 10){

                        matrixB[a][b] = numB;
                    }
                    else{

                        printf("Δώσε αριθμό εντός ορίων.\n");
                        b--; // Στέλνει το for μία φορά πίσω ώστε να ξαναδώσει τιμή ο χρήστης.
                    }
                }
            }
            break;
        }
        else if(epilogiB == 1){

            // Γέμισμα.
            for(int a = 0; a < k; a++){

                for(int b = 0; b < j; b++){

                    matrixB[a][b] = rand()%10;
                }
            }
            break;
        }

        printf("\nΠληκτρολόγησε σωστά.\n");
    }


    //////////////////////////////////////
    //////////////////////////////////////
    //////////////////////////////////////


    printf("\nΘέλεις να γεμίσεις το 1ο διάνυσμα μόνος σου (με διψήφιους ακεραίους 0-10)[πληκτρολόγησε 0]\nή να το κάνει ο υπολογιστής με ψευδοτυχαίους [πληκτρολόγησε 1];\n");

    while(1){

        printf("> ");
        scanf("%d", &epilogi1);

        if(epilogi1 == 0){

            printf("\nΓέμισέ το!\n");
            // Γέμισμα.
            for(int a = 0; a < d1; a++){

                printf("> ");
                scanf("%d", &num1);

                if(num1 >= 0 && num1 <= 10){

                    vectorA[a] = num1;
                }
                else{

                    printf("Δώσε αριθμό εντός ορίων.\n");
                    a--; // Στέλνει το for μία φορά πίσω ώστε να ξαναδώσει τιμή ο χρήστης.
                }
            }
            break;
        }
        else if(epilogi1 == 1){

            // Γέμισμα.
            for(int a = 0; a < d1; a++){

                vectorA[a] = rand()%10;
            }
            break;
        }

        printf("\nΠληκτρολόγησε σωστά.\n");
    }

    printf("\nΘέλεις να γεμίσεις το 2ο διάνυσμα μόνος σου (με διψήφιους ακεραίους 0-10)[πληκτρολόγησε 0]\nή να το κάνει ο υπολογιστής με ψευδοτυχαίους [πληκτρολόγησε 1];\n");

        while(1){

        printf("> ");
        scanf("%d", &epilogi2);

        if(epilogi2 == 0){

            printf("\nΓέμισέ το!\n");
            // Γέμισμα.
            for(int a = 0; a < d2; a++){

                printf("> ");
                scanf("%d", &num2);

                if(num2 >= 0 && num2 <= 10){

                    vectorB[a] = num2;
                }
                else{

                    printf("Δώσε αριθμό εντός ορίων.\n");
                    a--; // Στέλνει το for μία φορά πίσω ώστε να ξαναδώσει τιμή ο χρήστης.
                }
            }
            break;
        }
        else if(epilogi2 == 1){

            // Γέμισμα.
            for(int a = 0; a < d2; a++){

                vectorB[a] = rand()%10;
            }
            break;
        }

        printf("\nΠληκτρολόγησε σωστά.\n");
    }

    //////////////////////////////////////

    // Εμφάνιση πίνακα Α.
    printf("\n- matrix A -\n");
    for(int a = 0; a < m; a++){

        printf("|");
        for(int b = 0; b < n; b++){

            printf("%2d ", matrixA[a][b]);
        }
        printf("|\n");
    }


    // Εμφάνιση πίνακα Β.
    printf("\n- matrix B -\n");
    for(int a = 0; a < k; a++){

        printf("|");
        for(int b = 0; b < j; b++){

            printf("%2d ", matrixB[a][b]);
        }
        printf("|\n");
    }


    // Εμφάνιση 1ου διανύσματος.
    printf("\n- vector a -\n");
    printf("(");
    for(int a = 0; a < d1; a++){

        // Αυτό το ζεύγος if-else μπήκε για να ομορφήνει την εμφάνιση του διανύσματος.
        if(a == (d1 - 1)){

            printf("%d", vectorA[a]);
        }
        else{

            printf("%d, ", vectorA[a]);
        }
    }
    printf(")\n");


    // Εμφάνιση 2ου διανύσματος.
    printf("\n- vector b -\n");
    printf("(");
    for(int a = 0; a < d2; a++){

        // Αυτό το ζεύγος if-else μπήκε για να ομορφήνει την εμφάνιση του διανύσματος.
        if(a == (d2 - 1)){

            printf("%d", vectorB[a]);
        }
        else{

            printf("%d, ", vectorB[a]);
        }
    }
    printf(")\n");
    printf("\n");

    //////////////////////////////////////

    //////////////////////////////////////

    // Οι πράξεις μεταξύ των πινάκων και των διανυσμάτων (Υπολογισμός και Εμφάνιση).

    //////////////////////////////////////


    int sum = 0; // Το άθροισμα των στοιχείων, τέλος πάντων, ώστε να υπολογισθεί ο πίνακας A x B.
    int traceA = 0; // Το ίχνος του πίνακα Α.
    int traceB = 0; // Το ίχνος του πίνακα Β.

    int matrixAplusB[m][n];
    int matrixAminusB[m][n];
    int matrixAB[m][j];

    // Αυτές οι 3 μεταβλητές είναι μετρητές για το ποιές πράξεις έγιναν.
    // Αν και όταν γίνουν και οι τρεις πράξεις, η while θα κάνει break.
    // Μόλις γίνουν και οι τρεις πράξεις το πρόγραμμα θα συνεχίζει παρακάτω.

    int a1, a11 = 0; // Πρόσθεση.
    int a2, a22 = 0; // Αφαίρεση.
    int a3, a33 = 0; // Πολλαπλασιασμός.
    int a4 = 0; // Ανάστροφος του Α.
    int a5 = 0; // Ανάστροφος του Β.
    int a6, a66 = 0; // Ίχνος του Α.
    int a7, a77 = 0; // Ίχνος του Β.

    // Όλες οι πράξεις έγιναν, stop, or
    // όλες οι πράξεις δεν έγιναν, πάλι stop, or
    // μόνο πολλαπλασιασμός μπορεί να γίνει, και έγινε, πάλι stop.
    // Αν μπορεί να γίνει ΜΟΝΟ ο πολλαπλασιασμός, τότε mono_pollaplasiasmos == 1
    // και a11 == 1 και a22 == 1.

    printf("\n\nΔιάλεξε πράξη μεταξύ πινάκων:\n");
    printf("1. Πρόσθεση\n");
    printf("2. Αφαίρεση\n");
    printf("3. Πολλαπλασιασμός\n");
    printf("4. Ανάστροφος του Α\n");
    printf("5. Ανάστροφος του Β\n");
    printf("6. Ίχνος του Α\n");
    printf("7. Ίχνος του Β\n");
    printf("Δώσε το αντίστοιχο νούμερο (1,2,3,4,5,6,7).\n");
    printf("Δώσε 0 για να πας παρακάτω.\n\n");

    while(1){

        if((a1 == 1 && a2 == 1 && a3 == 1 && a4 == 1 && a5 == 1 && a6 == 1 && a7 == 1) || (a11 == 1 && a22 == 1 && a33 == 1 && a4 == 1 && a5 == 1 && a66 == 1 && a77 == 1) || (a11 == 1 && a22 == 1 && a66 == 1 && a77 == 1 && a3 == 1 && a4 == 1 && a5 == 1) || (a11 == 1 && a22 == 1 && a33 == 1 && a66 == 1 && a77 == 1 && a4 == 1 && a5 == 1) || (a11 = 1 && a22 == 1 && a33 == 1 && a4 == 1 && a5 == 1 && a6 == 1 && a7 == 1)){ // Έλεγχος!

            // Όλες οι πράξεις έγιναν ή όλες οι πράξεις δεν έγιναν (πλην αναστρόφων) ή μόνο ο πολλαπλασιασμός
            // και οι ανάστροφοι μπορούν να γίνουν, δηλαδή όχι ίχνοι,(και έγιναν) ή μόνο οι ανάστροφοι μπορούν να γίνουν (και έγιναν)
            // ή μόνο ανάστροφοι και ίχνοι μπορούν να γίνουν (και έγιναν).
            break;
        }

        printf("Πράξη > ");
        scanf("%d", &praji1);

        if(praji1 == 0){ // Πας παρακάτω.

            break;
        }
        else if(praji1 == 1){ // Πρόσθεση.

            if((m == k) && (n == j)){

                if(a1 == 1){

                    printf(""); // Αφού έγινε η πρώτη πρόσθεση, τότε δεν πρέπει να γίνει δεύτερη, οπότε
                                // αν ο χρήστης την ξαναεπιλέξει δεν θα εμφανίζεται τίποτα.
                }
                else{

                    // Υπολογισμός Α + Β.
                    for(int a = 0; a < m; a++){

                        for(int b = 0; b < n; b++){

                            matrixAplusB[a][b] = matrixA[a][b] + matrixB[a][b];
                        }
                    }

                    // Εμφάνιση Α + Β.
                    printf("\n- matrix (A + B) -\n");
                    for(int a = 0; a < m; a++){

                        printf("|");
                        for(int b = 0; b < n; b++){

                            printf("%2d ", matrixAplusB[a][b]);
                        }
                        printf("|\n");
                    }
                    printf("\n");

                    a1 = 1; // Μόλις γίνει η πρώτη πρόσθεση θα πετάξει a1 = 1.
                }
            }
            else{

                if(a11 == 1){

                    printf("");
                }
                else{

                    printf("Δεν υφίσταται πρόσθεση μεταξύ των πινάκων.\n\n");
                    a11 = 1;
                }
            }
        }
        else if(praji1 == 2){ // Αφαίρεση.

            if((m == k) && (n == j)){

                if(a2 == 1){

                    printf(""); // Αφού έγινε η πρώτη αφαίρεση, τότε δεν πρέπει να γίνει δεύτερη, οπότε
                                // αν ο χρήστης την ξαναεπιλέξει δεν θα εμφανίζεται τίποτα.
                }
                else{

                    // Υπολογισμός Α - Β.
                    for(int a = 0; a < m; a++){

                        for(int b = 0; b < n; b++){

                            matrixAminusB[a][b] = matrixA[a][b] - matrixB[a][b];
                        }
                    }

                    // Εμφάνιση Α - Β.
                    printf("\n- matrix (A - B) -\n");
                    for(int a = 0; a < m; a++){

                        printf("|");
                        for(int b = 0; b < n; b++){

                            printf("%2d ", matrixAminusB[a][b]);
                        }
                        printf("|\n");
                    }
                    printf("\n");

                    a2 = 1; // Μόλις γίνει η πρώτη αφαίρεση θα πετάξει a2 = 1.
                }
            }
            else{

                if(a22 == 1){

                    printf("");
                }
                else{

                    printf("Δεν υφίσταται αφαίρεση μεταξύ των πινάκων.\n\n");
                    a22 = 1;
                }
            }
        }
        else if(praji1 == 3){ // Πολλαπλασιασμός.

            if(n == k){

                if(a3 == 1){

                    printf(""); // Αφού έγινε ο πρώτος πολλαπλασιασμός, τότε δεν πρέπει να γίνει δεύτερος, οπότε
                                // αν ο χρήστης τον ξαναεπιλέξει δεν θα εμφανίζεται τίποτα.
                }
                else{
                    // Υπολογισμός Α x Β.
                    for(int a = 0; a < m; a++){

                        for(int b = 0; b < j; b++){

                            sum = 0;
                            for(int l = 0; l < n; l++){

                                sum += matrixA[a][l]*matrixB[l][b];
                            }
                            matrixAB[a][b] = sum;
                        }
                    }

                    // Εμφάνιση A x B.
                    printf("\n- matrix (A x B) - \n");
                    for(int a = 0; a < m; a++){

                        printf("|");
                        for(int b = 0; b < j; b++){

                            printf("%2d ", matrixAB[a][b]);
                        }
                        printf("|\n");
                    }
                    printf("\n");

                    a3 = 1; // Μόλις γίνει ο πρώτος πολλαπλασιασμός θα πετάξει a3 = 1.
                }
            }
            else{

                if(a33 == 1){

                    printf("");
                }
                else{

                    printf("Δεν υφίσταται πολλαπλασιασμός μεταξύ των πινάκων.\n\n");
                    a33 = 1;
                }
            }
        }
        else if(praji1 == 4){ // Ανάστροφος του Α.

            if(a4 == 1){

                printf("");
            }
            else{

                printf("\n- transpose of matrix A -\n");
                for(int a = 0; a < n; a++){

                    printf("|");
                    for(int b = 0; b < m; b++){

                        printf("%2d ", matrixA[b][a]);
                    }
                    printf("|\n");
                }

                printf("\n");
                a4 = 1;
            }
        }
        else if(praji1 == 5){ // Ανάστροφος του Β.

            if(a5 == 1){

                printf("");
            }
            else{

                printf("\n- transpose of matrix B -\n");
                for(int a = 0; a < j; a++){

                    printf("|");
                    for(int b = 0; b < k; b++){

                        printf("%2d ", matrixB[b][a]);
                    }
                    printf("|\n");
                }
                printf("\n");
                a5 = 1;
            }
        }
        else if(praji1 == 6){ // Ίχνος του Α.

            if(m == n){

                if(a6 == 1){

                    printf("");
                }
                else{

                    for(int a = 0; a < m; a++){

                        for(int b = 0; b < n; b++){

                            if(a == b){

                                traceA += matrixA[a][b];
                            }
                        }
                    }

                    printf("Το ίχνος του πίνακα Α είναι: %d\n\n", traceA);
                    a6 = 1;
                }
            }
            else{

                if(a66 == 1){

                    printf("");
                }
                else{

                    printf("Δεν υφίσταται το ίχνος του πίνακα Α.\n\n");
                    a66 = 1;
                }
            }
        }
        else if(praji1 == 7){

            if(k == j){

                if(a7 == 1){

                    printf("");
                }
                else{

                    for(int a = 0; a < k; a++){

                        for(int b = 0; b < j; b++){

                            if(a == b){

                                traceB += matrixB[a][b];
                            }
                        }
                    }

                    printf("Το ίχνος του πίνακα B είναι: %d\n\n", traceB);
                    a7 = 1;
                }
            }
            else{

                if(a77 == 1){

                    printf("");
                }
                else{

                    printf("Δεν υφίσταται το ίχνος του πίνακα Β.\n\n");
                    a77 = 1;
                }
            }
        }
        else{ // Λάθος πράξη.

            printf("Δώστε σωστή πράξη.\n\n");
        }
    }

    //////////////////////////////////////
    //////////////////////////////////////
    //////////////////////////////////////

    int inner_product = 0; // Το εσωτερικό γινόμενο των δύο διανυσμάτων (βαθμωτό μέγεθος).
    const int d = d1; // Ορίζω ενιαία διάσταση διανυσμάτων d, αφού d1 = d2 = d.

    int length1 = 0;
    int length2 = 0;
    int gwnia = 0;

    int vectorAplusB[d];
    int vectorAminusB[d];

    // Αυτές οι 3 μεταβλητές είναι μετρητές για το ποιές πράξεις έγιναν.
    // Αν και όταν γίνουν και οι τρεις πράξεις, η while θα κάνει break.
    // Μόλις γίνουν και οι τρεις πράξεις το πρόγραμμα θα συνεχίζει παρακάτω.

    int b1, b11 = 0;
    int b2, b22 = 0;
    int b3, b33 = 0;
    int b4 = 0;
    int b5 = 0;
    int b6, b66 = 0;

    printf("\n\nΔιάλεξε πράξη μεταξύ διανυσμάτων:\n");
    printf("1. Πρόσθεση\n");
    printf("2. Αφαίρεση\n");
    printf("3. Εσωτερικό Γινόμενο\n");
    printf("4. Μέτρο 1ου διανύσματος\n");
    printf("5. Μέτρο 2ου διανύσματος\n");
    printf("6. Γωνία μεταξύ των δύο διανυσμάτων\n");
    printf("Δώσε 0 για να τερματίσεις το πρόγραμμα.\n\n");

    while(1){

        if((b1 == 1 && b2 == 1 && b3 == 1 && b4 == 1 && b5 == 1 && b6 == 1) || (b11 == 1 && b22 == 1 && b33 == 1 && b4 == 1 && b5 == 1 && b66 == 1)){ // Έλεγχος!

            // Όλες οι πράξεις έγιναν ή όλες οι πράξεις δεν έγιναν εκτός από τα μέτρα (τα οποία γίνονται ούτως ή άλλως).
            // Για να γίνει η πράξη της γωνίας πρέπει πρώτα να υπολογιστούν τα μέτρα των διανυσμάτων
            // και το εσωτερικό τους γινόμενο, πράγμα που θέλει ειδική μαγκιά.
            break;
        }

        printf("Πράξη > ");
        scanf("%d", &praji2);

        if(praji2 == 0){ // Τερματίζεις το πρόγραμμα.

            printf("Τερματισμός...\n");
            exit(0);
        }
        else if(praji2 == 1){ // Πρόσθεση.

            if(d1 == d2){

                if(b1 == 1){

                    printf("");
                }
                else{

                    // Υπολογισμός του a + b.
                    for(int a = 0; a < d; a++){

                        vectorAplusB[a] = vectorA[a] + vectorB[a];
                    }

                    // Εμφάνιση του a + b.
                    printf("\n- vector (a + b) -\n");
                    printf("(");
                    for(int a = 0; a < d; a++){

                        // Αυτό το ζεύγος if-else μπήκε για να ομορφήνει την εμφάνιση του διανύσματος.
                        if(a == (d - 1)){

                            printf("%d", vectorAplusB[a]);
                        }
                        else{

                            printf("%d, ", vectorAplusB[a]);
                        }
                    }
                    printf(")\n");
                    printf("\n");

                    b1 = 1;
                }
            }
            else{

                if(b11 == 1){

                    printf("");
                }
                else{

                    printf("Δεν υφίσταται πρόσθεση μεταξύ των διανυσμάτων.\n\n");
                    b11 = 1;
                }
            }
        }
        else if(praji2 == 2){ // Αφαίρεση.


            if(d1 == d2){

                if(b2 == 1){

                    printf("");
                }
                else{

                    // Υπολογισμός του a - b.
                    for(int a = 0; a < d; a++){

                        vectorAminusB[a] = vectorA[a] - vectorB[a];
                    }

                    // Εμφάνιση του a - b.
                    printf("\n- vector (a - b) -\n");
                    printf("(");
                    for(int a = 0; a < d; a++){

                        // Αυτό το ζεύγος if-else μπήκε για να ομορφήνει την εμφάνιση του διανύσματος.
                        if(a == (d - 1)){

                            printf("%d", vectorAminusB[a]);
                        }
                        else{

                            printf("%d, ", vectorAminusB[a]);
                        }
                    }
                    printf(")\n");
                    printf("\n");

                    b2 = 1;
                }
            }
            else{

                if(b22 == 1){

                    printf("");
                }
                else{

                    printf("Δεν υφίσταται αφαίρεση μεταξύ των διανυσμάτων.\n\n");
                    b22 = 1;
                }
            }
        }
        else if(praji2 == 3){ // Εσωτερικό Γινόμενο.

            if(d1 == d2){

                if(b3 == 1){

                    printf(""); // Αφού έγινε το πρώτο εσωτερικό γινόμενο, τότε δεν πρέπει να γίνει δεύτερο, οπότε
                                // αν ο χρήστης το ξαναεπιλέξει δεν θα εμφανίζεται τίποτα.
                }
                else{

                    // Υπολογισμός του εσωτερικού γινομένου.
                    for(int a = 0; a < d; a++){

                        inner_product += vectorA[a]*vectorB[a];
                    }

                    // Εμφάνιση του εσωτερικού γινομένου.
                    printf("Το εσωτερικό γινόμενο είναι: %d\n", inner_product);
                    printf("\n");

                    b3 = 1; // Μόλις γίνει το πρώτο εσωτερικό γινόμενο θα πετάξει b3 = 1.
                }
            }
            else{

                if(b33 == 1){

                    printf("");
                }
                else{

                    printf("Δεν υφίσταται εσωτερικό γινόμενο των διανυσμάτων.\n\n");
                    b33 = 1;
                }
            }
        }
        else if(praji2 == 4){ // Μέτρο του 1ου διανύσματος.

            if(b4 == 1){

                printf("");
            }
            else{

                for(int a = 0; a < d1; a++){

                    length1 += pow(vectorA[a], 2);
                }
                printf("Το μέτρο του 1ου διανύσματος είναι: %.2f\n\n",  sqrt(length1));
                b4 = 1;
            }
        }
        else if(praji2 == 5){ // Μέτρο του 2ου διανύσματος.

            if(b5 == 1){

                printf("");
            }
            else{

                for(int a = 0; a < d2; a++){

                    length2 += pow(vectorB[a], 2);
                }
                printf("Το μέτρο του 2ου διανύσματος είναι: %.2f\n\n",  sqrt(length2));
                b5 = 1;
            }
        }
        else if(praji2 == 6){ // Η γωνία μεταξύ των διανυσμάτων.

            if(d1 == d2){

                if(b3 == 1 && b4 == 1 && b5 == 1){

                    if(b6 == 1){

                        printf("");
                    }
                    else{

                        if(sqrt(length1)*sqrt(length2) == 0){

                            printf("Σφάλμα, ο παρονομαστής είναι 0.\nn");
                            b6 = 1;
                        }
                        else{

                            if(inner_product == 0){

                                printf("Τα διανύσματα είναι κάθετα μεταξύ τους.\n\n");
                                b6 = 1;
                            }
                            else{

                                gwnia = acos(inner_product/(sqrt(length1)*sqrt(length2)))*180/PI;
                                printf("Η γωνία μεταξύ των διανυσμάτων είναι %d μοίρες.\n\n", gwnia);
                                b6 = 1;
                            }
                        }
                    }
                }
                else{

                    printf("Πρέπει πρώτα να υπολογίσεις το εσωτερικό γινόμενο και τα μέτρα των δύο διανυσμάτων.\n\n");
                }
            }
            else{

                if(b66 == 1){

                    printf("");
                }
                else{

                    printf("Δεν υφίσταται υπολογισμός της γωνίας μεταξύ των δύο διανυσμάτων.\n\n");
                    b66 = 1;
                }
            }
        }
        else{ // Λάθος πράξη.

            printf("Δώστε σωστή πράξη.\n\n");
        }
    }

    return 0;
}

